[{"isbn":"0765378558","fetch":false,"title":"Shadows of Self","authors":["Brandon Sanderson"],"publisher":"Macmillan","publishedDate":"2015-10-06","description":"The #1 New York Times bestselling author returns to the world of Mistborn with his first novel in the series since The Alloy of Law. With The Alloy of Law, Brandon Sanderson surprised readers with a New York Times bestselling spinoff of his Mistborn books, set after the action of the trilogy, in a period corresponding to late 19th-century America. The trilogy's heroes are now figures of myth and legend, even objects of religious veneration. They are succeeded by wonderful new characters, chief among them Waxillium Ladrian, known as Wax, hereditary Lord of House Ladrian but also, until recently, a lawman in the ungoverned frontier region known as the Roughs. There he worked with his eccentric but effective buddy, Wayne. They are \"twinborn,\" meaning they are able to use both Allomantic and Feruchemical magic. Shadows of Self shows Mistborn's society evolving as technology and magic mix, the economy grows, democracy contends with corruption, and religion becomes a growing cultural force, with four faiths competing for converts. This bustling, optimistic, but still shaky society now faces its first instance of terrorism, crimes intended to stir up labor strife and religious conflict. Wax and Wayne, assisted by the lovely, brilliant Marasi, must unravel the conspiracy before civil strife stops Scadrial's progress in its tracks. Shadows of Self will give fans of The Alloy of Law everything they've been hoping for and, this being a Brandon Sanderson book, more, much more.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780765378552"},{"type":"ISBN_10","identifier":"0765378558"}],"readingModes":{"text":false,"image":false},"pageCount":384,"printType":"BOOK","categories":["Fiction"],"averageRating":4,"ratingsCount":39,"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"0.1.0.0.preview.0","imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=pShfCgAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=pShfCgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=pShfCgAAQBAJ&dq=isbn:0765378558&hl=&cd=1&source=gbs_api","infoLink":"http://books.google.com/books?id=pShfCgAAQBAJ&dq=isbn:0765378558&hl=&source=gbs_api","canonicalVolumeLink":"http://books.google.com/books/about/Shadows_of_Self.html?hl=&id=pShfCgAAQBAJ"},{"isbn":"9781449372637","fetch":false,"title":"CSS Secrets","authors":["Lea Verou"],"publisher":"O'Reilly Media","publishedDate":"2015-05-14","description":"Based on two popular talks from author Lea Verou—including \"CSS3 Secrets: 10 things you may not know about CSS\"—this practical guide provides intermediate to advanced CSS developers with more than 40 undocumented techniques and tips for using CSS3 to create better websites. The talks that spawned this book have been top-rated by attendees in every conference they were presented, and praised in industry media such as .net magazine. Get information you won’t find in any other book Learn through small, easily digestible chapters Helps you understand CSS more deeply so you can improve your own solutions Apply Lea’s techniques to practically every CSS problem you face Gain tips from a rockstar author who serves as an Invited Expert in W3C’s CSS Working Group","industryIdentifiers":[{"type":"ISBN_10","identifier":"1449372635"},{"type":"ISBN_13","identifier":"9781449372637"}],"readingModes":{"text":false,"image":false},"pageCount":350,"printType":"BOOK","categories":["Computers"],"averageRating":5,"ratingsCount":1,"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"preview-1.0.0","imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=mAwknwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=mAwknwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=mAwknwEACAAJ&dq=isbn:9781449372637&hl=&cd=1&source=gbs_api","infoLink":"http://books.google.com/books?id=mAwknwEACAAJ&dq=isbn:9781449372637&hl=&source=gbs_api","canonicalVolumeLink":"http://books.google.com/books/about/CSS_Secrets.html?hl=&id=mAwknwEACAAJ"}]